-- -------------------------------------------------------------
-- TablePlus 6.4.4(604)
--
-- https://tableplus.com/
--
-- Database: astrolog
-- Generation Time: 2025-04-29 22:00:31.0260
-- -------------------------------------------------------------


-- This script only contains the table creation statements and does not fully represent the table in the database. Do not use it as a backup.

-- Sequence and defined type
CREATE SEQUENCE IF NOT EXISTS chinese_emojis_id_seq;

-- Table Definition
CREATE TABLE "public"."chinese_emojis" (
    "id" int4 NOT NULL DEFAULT nextval('chinese_emojis_id_seq'::regclass),
    "form" text NOT NULL,
    "emoji" text NOT NULL,
    PRIMARY KEY ("id")
);

INSERT INTO "public"."chinese_emojis" ("id", "form", "emoji") VALUES
(1, 'Крыса', '🐀'),
(2, 'Крысы', '🐀'),
(3, 'Крысе', '🐀'),
(4, 'Крысой', '🐀'),
(5, 'Бык', '🐂'),
(6, 'Быка', '🐂'),
(7, 'Быку', '🐂'),
(8, 'Быком', '🐂'),
(9, 'Тигр', '🐅'),
(10, 'Тигра', '🐅'),
(11, 'Тигру', '🐅'),
(12, 'Тигром', '🐅'),
(13, 'Кролик', '🐇'),
(14, 'Кролика', '🐇'),
(15, 'Кролику', '🐇'),
(16, 'Кроликом', '🐇'),
(17, 'Дракон', '🐉'),
(18, 'Дракона', '🐉'),
(19, 'Дракону', '🐉'),
(20, 'Драконом', '🐉'),
(21, 'Змея', '🐍'),
(22, 'Змеи', '🐍'),
(23, 'Змее', '🐍'),
(24, 'Змеёй', '🐍'),
(25, 'Лошадь', '🐎'),
(26, 'Лошади', '🐎'),
(27, 'Лошадью', '🐎'),
(28, 'Коза', '🐐'),
(29, 'Козы', '🐐'),
(30, 'Козе', '🐐'),
(31, 'Козой', '🐐'),
(32, 'Обезьяна', '🐒'),
(33, 'Обезьяны', '🐒'),
(34, 'Обезьяне', '🐒'),
(35, 'Обезьяной', '🐒'),
(36, 'Петух', '🐓'),
(37, 'Петуха', '🐓'),
(38, 'Петуху', '🐓'),
(39, 'Петухом', '🐓'),
(40, 'Собака', '🐕'),
(41, 'Собаки', '🐕'),
(42, 'Собаке', '🐕'),
(43, 'Собакой', '🐕'),
(44, 'Свинья', '🐖'),
(45, 'Свиньи', '🐖'),
(46, 'Свинье', '🐖'),
(47, 'Свиньёй', '🐖');
