-- -------------------------------------------------------------
-- TablePlus 6.4.4(604)
--
-- https://tableplus.com/
--
-- Database: astrolog
-- Generation Time: 2025-04-29 22:02:52.4110
-- -------------------------------------------------------------


-- This script only contains the table creation statements and does not fully represent the table in the database. Do not use it as a backup.

-- Sequence and defined type
CREATE SEQUENCE IF NOT EXISTS zodiac_emojis_id_seq;

-- Table Definition
CREATE TABLE "public"."zodiac_emojis" (
    "id" int4 NOT NULL DEFAULT nextval('zodiac_emojis_id_seq'::regclass),
    "form" text NOT NULL,
    "emoji" text NOT NULL,
    PRIMARY KEY ("id")
);

INSERT INTO "public"."zodiac_emojis" ("id", "form", "emoji") VALUES
(1, 'Овен', '♈'),
(2, 'Овна', '♈'),
(3, 'Овну', '♈'),
(4, 'Овном', '♈'),
(5, 'Телец', '♉'),
(6, 'Тельца', '♉'),
(7, 'Тельцу', '♉'),
(8, 'Тельцом', '♉'),
(9, 'Близнецы', '♊'),
(10, 'Близнецов', '♊'),
(11, 'Близнецам', '♊'),
(12, 'Рак', '♋'),
(13, 'Рака', '♋'),
(14, 'Раку', '♋'),
(15, 'Раком', '♋'),
(16, 'Лев', '♌'),
(17, 'Льва', '♌'),
(18, 'Льву', '♌'),
(19, 'Львом', '♌'),
(20, 'Дева', '♍'),
(21, 'Девы', '♍'),
(22, 'Деве', '♍'),
(23, 'Девой', '♍'),
(24, 'Весы', '♎'),
(25, 'Весов', '♎'),
(26, 'Весам', '♎'),
(27, 'Скорпион', '♏'),
(28, 'Скорпиона', '♏'),
(29, 'Скорпиону', '♏'),
(30, 'Скорпионом', '♏'),
(31, 'Стрелец', '♐'),
(32, 'Стрельца', '♐'),
(33, 'Стрельцу', '♐'),
(34, 'Стрельцом', '♐'),
(35, 'Козерог', '♑'),
(36, 'Козерога', '♑'),
(37, 'Козерогу', '♑'),
(38, 'Козерогом', '♑'),
(39, 'Водолей', '♒'),
(40, 'Водолея', '♒'),
(41, 'Водолею', '♒'),
(42, 'Водолеем', '♒'),
(43, 'Рыбы', '♓'),
(44, 'Рыб', '♓'),
(45, 'Рыбам', '♓');
